{
  "dataset": "sh",
  "descriptions": {
    "openTime": "Candle open time in UTC as Date. Represents the start of a 24 hour daily bar. Only fully closed days are stored. Use to index the series and to join with external datasets and to filter time ranges.",
    "open": "Trade price in usdt at the bar open. Taken from the first trade of the daily session. Used for gap checks session to session and for calculating returns and for candle body size diagnostics.",
    "high": "Highest traded price within the daily session. Captures intraday extremes and breakout attempts. Useful for Donchian channels and for volatility studies and for stop placement logic and for wick analysis.",
    "low": "Lowest traded price within the daily session. Captures intraday extremes and liquidity sweeps. Useful for Donchian channels and for volatility studies and for identifying swing lows and for risk management levels.",
    "close": "Trade price in usdt at the bar close. End of session print. Used by most indicators as the primary input. Drives moving averages momentum oscillators and end of day signals used in decisions.",
    "volume": "Base asset volume traded during the daily session. Unit is BTC. Used to confirm moves and to compute money flow metrics and to weight prices for VWAP like measures and to gauge market participation.",
    "closeTime": "Candle close time in UTC as Date. Represents the end of the 24 hour daily bar exclusive bound. Together with openTime defines the temporal extent and helps verify only closed bars are saved.",
    "qav": "Quote asset volume in usdt summed across trades within the daily session. Approximates money turnover. Useful to estimate per bar VWAP as qav divided by volume and to compare liquidity regimes across time.",
    "ntr": "Number of trades within the daily session. Proxy for market activity and fragmentation. Combined with volume gives average trade size which hints at retail versus larger flow dominance.",
    "tbb": "Base asset volume bought by taker side during the session. Represents aggressive market buy activity that removes liquidity. Used to estimate net order flow bias when compared to total volume.",
    "tbq": "Quote asset volume in usdt bought by taker side during the session. Provides the money value of aggressive buying. Complements tbb and supports order flow diagnostics and liquidity analysis.",
    "ignore": "Reserved field per Binance response. Kept for compatibility to maintain column alignment with the raw kline format. Not used in calculations and can be ignored for analysis.",
    "delta": "Net aggressive flow per day estimated as two times taker base minus total base volume. Positive values indicate buy pressure dominance. Negative values indicate sell pressure. Used to build cumulative volume delta.",
    "cvd": "Cumulative volume delta which sums per bar delta through time. Tracks the path of aggressive pressure. Divergences between cvd and price may hint at absorption or distribution by passive liquidity.",
    "tbr": "Taker buy ratio as taker base divided by total volume. Measures how much of traded volume came from aggressive buyers. Values near one suggest strong buy pressure. Values near zero suggest strong sell pressure.",
    "rvol20": "Relative volume over the last twenty sessions computed as today volume divided by the twenty day simple average of volume. Detects participation spikes and droughts and helps filter breakouts by strength.",
    "avg_trade": "Average trade size proxy computed as volume divided by number of trades. Larger values suggest fewer bigger prints and possible professional activity. Smaller values suggest more fragmented retail like activity.",
    "vwap_bar": "Per bar VWAP approximation computed as qav divided by volume. Serves as a daily fair value estimate. Comparison of close versus this level indicates premium or discount within the session.",
    "vwap_sess": "Cumulative session VWAP from the start of the dataset computed as running sum of qav divided by running sum of volume. Acts as a long horizon fair value anchor for mean reversion or trend evaluation.",
    "vwma20": "Twenty day volume weighted moving average of close. Gives more weight to high participation days. Helps differentiate moves supported by volume from moves on thin activity which may be less reliable.",
    "sma20": "Simple moving average of close over twenty sessions. Short term trend proxy. Often used with price crossovers and with distance to average filters to avoid chasing stretched conditions.",
    "sma50": "Simple moving average of close over fifty sessions. Intermediate trend proxy. Works as a common support or resistance reference and defines the mid term bias for many participants.",
    "sma200": "Simple moving average of close over two hundred sessions. Long term trend gauge. Popular for bull or bear regime definition and for mapping high level support or resistance zones.",
    "ema12": "Exponential moving average of close over twelve sessions. Reacts faster than simple averages. Used within MACD to capture recent momentum and to reduce lag in crossover systems.",
    "ema26": "Exponential moving average of close over twenty six sessions. Slower leg of MACD calculations. Provides a baseline momentum reference to compare against the faster ema.",
    "ema50": "Exponential moving average of close over fifty sessions. Alternative intermediate trend smoother. Slightly faster response than sma50 due to exponential weighting which emphasizes recent data.",
    "macd": "Moving Average Convergence Divergence defined as ema12 minus ema26. Positive values show upside momentum. Negative values show downside momentum. Useful for momentum swings and centerline crosses.",
    "macd_sig": "Signal line for MACD computed as exponential moving average of macd over nine sessions. Used to generate macd crossing signal events and to smooth raw macd fluctuations.",
    "macd_hist": "MACD histogram defined as macd minus macd_sig. Visualizes momentum impulses. Expanding histogram suggests acceleration. Contracting histogram suggests deceleration and possible pivot risk.",
    "rsi14": "Wilder Relative Strength Index over fourteen sessions on close. Values above seventy hint at overbought risk and values below thirty hint at oversold risk. Divergences with price can signal exhaustion.",
    "roc10": "Rate of change over ten sessions computed as close divided by close ten bars ago minus one. Measures percentage change speed. Useful for momentum filters and for ranking periods by acceleration.",
    "obv": "On Balance Volume cumulative measure that adds volume when close rises and subtracts volume when close falls. Tracks whether volume confirms the direction of price trends.",
    "ad": "Accumulation Distribution line cumulative form. Computes close location value times volume and sums over time. Rises when closes are near highs on volume. Falls when closes are near lows on volume.",
    "cmf20": "Chaikin Money Flow over twenty sessions defined as the ratio of the sum of close location value times volume to the sum of volume. Positive values suggest accumulation. Negative values suggest distribution.",
    "mfi14": "Money Flow Index over fourteen sessions. RSI like oscillator that uses typical price and volume. Identifies overbought and oversold with volume sensitivity which can improve signal quality in some regimes.",
    "atr14": "Average True Range over fourteen sessions using Wilder smoothing. Measures typical daily movement size. Useful for stop placement position sizing and volatility regime detection.",
    "bb_mid": "Bollinger middle band which is the twenty day simple moving average of close. Serves as a mean reference for upper and lower bands and for pullback targeting in trends.",
    "bb_up": "Upper Bollinger band computed as middle band plus two standard deviations of close over twenty sessions. Marks high side envelope used for breakout studies and stretch detection.",
    "bb_dn": "Lower Bollinger band computed as middle band minus two standard deviations of close over twenty sessions. Marks low side envelope used for breakdown studies and stretch detection.",
    "bb_w": "Relative Bollinger width computed as band distance divided by middle band. Acts as a normalized volatility gauge to compare across price levels and long histories.",
    "kc_mid": "Keltner channel middle line as exponential moving average of close over twenty sessions. Forms the center for channels based on average true range envelopes.",
    "kc_up": "Upper Keltner channel computed as middle line plus two times atr14. Highlights expansion relative to typical range and often frames trend followers entries and trailing exits.",
    "kc_dn": "Lower Keltner channel computed as middle line minus two times atr14. Highlights contraction and breakdown risk and can assist with oversold bounce filters in ranges.",
    "di_plus": "Directional indicator plus computed from positive directional movement with Wilder smoothing divided by atr14 and scaled by one hundred. Indicates strength of upward movement component.",
    "di_minus": "Directional indicator minus computed from negative directional movement with Wilder smoothing divided by atr14 and scaled by one hundred. Indicates strength of downward movement component.",
    "adx14": "Average Directional Index over fourteen sessions using Wilder smoothing of DX. Measures trend strength without regard to direction. Higher values indicate stronger trends.",
    "don20_hi": "Donchian twenty bar highest high. Marks breakout level for short term trend following systems and for stop placement above ranges.",
    "don20_lo": "Donchian twenty bar lowest low. Marks breakdown level for short term trend following systems and for stop placement below ranges.",
    "don55_hi": "Donchian fifty five bar highest high. Classic long term Turtle breakout threshold used to capture large trends and to avoid noise.",
    "don55_lo": "Donchian fifty five bar lowest low. Classic long term Turtle breakdown threshold used for exits and short signals in trend systems.",
    "swing_hh": "Flag equals one when a new swing high exceeds the prior confirmed swing high under a k equals three fractal with amplitude and spacing filters. Helps confirm uptrend structure.",
    "swing_hl": "Flag equals one when a new swing low is higher than the prior confirmed swing low under a k equals three fractal with amplitude and spacing filters. Helps confirm constructive pullbacks.",
    "swing_lh": "Flag equals one when a new swing high is lower than the prior confirmed swing high which signals possible downtrend continuation or weakening rallies under the same pivot rules.",
    "swing_ll": "Flag equals one when a new swing low undercuts the prior confirmed swing low which signals downtrend continuation risk and momentum to the downside.",
    "bull_div_rsi": "Flag equals one when price makes a lower low while RSI makes a higher low based on recent pivots. Suggests bullish divergence and potential reversal or loss of downside momentum.",
    "bear_div_rsi": "Flag equals one when price makes a higher high while RSI makes a lower high based on recent pivots. Suggests bearish divergence and potential reversal or loss of upside momentum.",
    "bull_div_cvd": "Flag equals one when price makes a lower low while CVD makes a higher low. Implies buyers absorb sells at lows and may precede upward mean reversion.",
    "bear_div_cvd": "Flag equals one when price makes a higher high while CVD makes a lower high. Implies sellers absorb buys near highs and may precede downward mean reversion.",
    "fib20_382": "Fibonacci retracement at 38.2 percent of the last twenty bar range using rolling high and low. Provides pullback targets and support estimation within short term swings.",
    "fib20_500": "Fibonacci level at 50 percent of the last twenty bar range. Common midpoint used for balance tests and for fair value reversion checks.",
    "fib20_618": "Fibonacci retracement at 61.8 percent of the last twenty bar range. Classic golden ratio area where trends often resume after corrective legs.",
    "fib55_382": "Fibonacci retracement at 38.2 percent of the last fifty five bar range. Useful for medium term pullback zones and for scale in planning.",
    "fib55_500": "Fibonacci level at 50 percent of the last fifty five bar range. Midpoint focus for mean reversion and for decision checkpoints.",
    "fib55_618": "Fibonacci retracement at 61.8 percent of the last fifty five bar range. Key support or resistance zone for medium term legs.",
    "fib_sw_382": "Swing anchored Fibonacci 38.2 percent using the most recent confirmed swing low and swing high pair from fractal pivots. Updates as new swings confirm and frames reaction zones.",
    "fib_sw_500": "Swing anchored Fibonacci 50 percent using the most recent confirmed swing pair. Marks fair value area between last key low and high.",
    "fib_sw_618": "Swing anchored Fibonacci 61.8 percent using the most recent confirmed swing pair. Classic continuation zone after corrections.",
    "fibA_382": "Event anchored Fibonacci 38.2 percent using the last detected cross between sma50 and sma200 as anchor window. If no cross exists the earliest available region is used. Helps tie levels to regime shifts.",
    "fibA_500": "Event anchored Fibonacci 50 percent from the same anchor window. Serves as balanced retracement or reaction area in the current regime.",
    "fibA_618": "Event anchored Fibonacci 61.8 percent from the same anchor window. Key continuation zone once corrective pressure fades."
  },
  "order": [
    "openTime",
    "open",
    "high",
    "low",
    "close",
    "volume",
    "closeTime",
    "qav",
    "ntr",
    "tbb",
    "tbq",
    "ignore",
    "delta",
    "cvd",
    "tbr",
    "rvol20",
    "avg_trade",
    "vwap_bar",
    "vwap_sess",
    "vwma20",
    "sma20",
    "sma50",
    "sma200",
    "ema12",
    "ema26",
    "ema50",
    "macd",
    "macd_sig",
    "macd_hist",
    "rsi14",
    "roc10",
    "obv",
    "ad",
    "cmf20",
    "mfi14",
    "atr14",
    "bb_mid",
    "bb_up",
    "bb_dn",
    "bb_w",
    "kc_mid",
    "kc_up",
    "kc_dn",
    "di_plus",
    "di_minus",
    "adx14",
    "don20_hi",
    "don20_lo",
    "don55_hi",
    "don55_lo",
    "swing_hh",
    "swing_hl",
    "swing_lh",
    "swing_ll",
    "bull_div_rsi",
    "bear_div_rsi",
    "bull_div_cvd",
    "bear_div_cvd",
    "fib20_382",
    "fib20_500",
    "fib20_618",
    "fib55_382",
    "fib55_500",
    "fib55_618",
    "fib_sw_382",
    "fib_sw_500",
    "fib_sw_618",
    "fibA_382",
    "fibA_500",
    "fibA_618"
  ]
}
